_posts/2012-01-18-emacs-tips.html
---
layout: post
title: "Emacs小技巧"
date: 2012-01-18 12:45
comments: true
categories: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Emacs使用技巧</a></li>
<li><a href="#sec-2">2 安装并配置.emacs.d的方法</a></li>
<li><a href="#sec-3">3 Paredit使用技巧</a></li>
<li><a href="#sec-4">4 Mark Ring使用</a></li>
<li><a href="#sec-5">5 Magit</a></li>
<li><a href="#sec-6">6 Fold</a></li>
<li><a href="#sec-7">7 Flyspell</a></li>
<li><a href="#sec-8">8 Misc Tips</a></li>
<li><a href="#sec-9">9 Gnus</a>
<ul>
<li><a href="#sec-9-1">9.1 快捷键使用</a></li>
</ul>
</li>
<li><a href="#sec-10">10 Key Bindings</a></li>
<li><a href="#sec-11">11 Org Mode</a>
<ul>
<li><a href="#sec-11-1">11.1 Orgtbl mode</a></li>
<li><a href="#sec-11-2">11.2 clock history</a></li>
<li><a href="#sec-11-3">11.3 如何利用norang中关于orgmode的设置</a></li>
</ul>
</li>
<li><a href="#sec-12">12 Tags</a>
<ul>
<li><a href="#sec-12-1">12.1 在Emacs中正确使用Ruby的tags的方法</a>
<ul>
<li><a href="#sec-12-1-1">12.1.1 编写watchr脚本用于动态更新TAGS文件</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-13">13 Screen中使用emacsclient的方法</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Emacs使用技巧</h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">安装并配置.emacs.d的方法</h2>
<div class="outline-text-2" id="text-2">


<p>
Emacs Starter Kit安装步骤
</p><ul>
<li>git clone下来我的.emacs.d文件
</li>
<li>git clone rinari到~/workspace/下
</li>
<li>git clone orgmode到~/workspace/下
</li>
<li>下载并安装ess,并执行make &amp;&amp; make install
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Paredit使用技巧</h2>
<div class="outline-text-2" id="text-3">


<p>
如果需要删除不匹配的"或(,)的时候，通过C-u, DEL来删除",通过C-q (,或C-q )来进行删除或处理。
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Mark Ring使用</h2>
<div class="outline-text-2" id="text-4">


<p>   
在buffer之内Emacs会默认保留16个跳转Mark，在Mark之间进行跳转时使用C-u M-@来进行设置。通过设置`set-mark-command-repeat-pop'为non-nil,可以在第一次使用C-u M-@跳转后，接着使用M-@来进行跳转。
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Magit</h2>
<div class="outline-text-2" id="text-5">


<p>
   <a href="http://zagadka.vim.bytemark.co.uk/magit/magit.html">Magit User Manual</a>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Fold</h2>
<div class="outline-text-2" id="text-6">


<p>
在使用fold-dwim来作fold的时候，需要打开hs-minor-mode，outline-minor-mode，或folding-mode。可以通过3个通用的命令来进行folding。分别为fold-dwim-toggle， fold-dwim-hide-all，fold-dwim-show-all。
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Flyspell</h2>
<div class="outline-text-2" id="text-7">


<p>
要正确地使用Flyspell功能，需要在系统中安装aspell和aspell-dict-en或其他的库程序。
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Misc Tips</h2>
<div class="outline-text-2" id="text-8">


<ul>
<li>当使用completion的时候，用M-v可以跳入completion list buffer，然后就可以在completion list buffer中选择对应的选项了。

</li>
<li>当terminal支持的颜色为16种或更少时，可以通过如下设置来设置terminal的类型。




<pre class="src src-sh"><span style="color: #8cd0d3;">export</span> <span style="color: #f0dfaf;">TERM</span>=xterm-256color;emacs -nw
</pre>


<p>
  可以通过M-x list-colors-display来查看当前支持的颜色数量。
</p>
</li>
<li>保存窗口配置信息并恢复的方法
  可以通过 <code>C-x r w RET SYMBOL RET</code> 来保存当前窗口的配置信息到 <code>SYMBOL=，进行其他操作改变窗口设置后，可以通过 =C-x r j SYMBOL</code> 来恢复原来的窗口设置信息。该方法在保存编译或调试窗口设置信息时较为高效。
</li>
</ul>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Gnus</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">快捷键使用</h3>
<div class="outline-text-3" id="text-9-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Mode</th><th scope="col" class="left">Key</th><th scope="col" class="left">Comment</th></tr>
</thead>
<tbody>
<tr><td class="left">Group</td><td class="left">AA</td><td class="left">列出所有新闻组</td></tr>
<tr><td class="left"></td><td class="left">u</td><td class="left">订阅新闻组</td></tr>
<tr><td class="left"></td><td class="left">L</td><td class="left">显示订阅新闻组</td></tr>
<tr><td class="left"></td><td class="left">l</td><td class="left">显示有未读邮件或新闻的组</td></tr>
<tr><td class="left"></td><td class="left">u</td><td class="left">退订新闻组，并未删除。L命令可以显示出来</td></tr>
<tr><td class="left"></td><td class="left">C-k</td><td class="left">彻底删除</td></tr>
<tr><td class="left"></td><td class="left">g</td><td class="left">查看新邮件或消息</td></tr>
<tr><td class="left"></td><td class="left">c</td><td class="left">当前新闻组标记为已读</td></tr>
<tr><td class="left"></td><td class="left">C</td><td class="left">所有新闻组标记为已读</td></tr>
<tr><td class="left"></td><td class="left">m</td><td class="left">创建新邮件</td></tr>
<tr><td class="left"></td><td class="left">a</td><td class="left">发帖子</td></tr>
<tr><td class="left">Summary</td><td class="left">a</td><td class="left">发帖子(post article)</td></tr>
<tr><td class="left"></td><td class="left">f</td><td class="left">回帖子(follow up)</td></tr>
<tr><td class="left"></td><td class="left">F</td><td class="left">回帖子，含引用</td></tr>
<tr><td class="left"></td><td class="left">d</td><td class="left">标记为已读</td></tr>
<tr><td class="left"></td><td class="left">！</td><td class="left">保留标记(ticked)，一直可见</td></tr>
<tr><td class="left"></td><td class="left">?</td><td class="left">休眠标记(dormant)，跟贴后可见</td></tr>
<tr><td class="left"></td><td class="left">r</td><td class="left">回邮件</td></tr>
<tr><td class="left"></td><td class="left">R</td><td class="left">回邮件，含引用</td></tr>
<tr><td class="left"></td><td class="left">c</td><td class="left">标记当前所有文章已读</td></tr>
<tr><td class="left"></td><td class="left">M-g</td><td class="left">刷新邮件组或新闻组</td></tr>
<tr><td class="left"></td><td class="left">M-u</td><td class="left">清除标记</td></tr>
<tr><td class="left"></td><td class="left">SPC</td><td class="left">Article Buffer翻页</td></tr>
<tr><td class="left"></td><td class="left">Backspace</td><td class="left">Article Buffer向上翻页</td></tr>
<tr><td class="left"></td><td class="left">/ o</td><td class="left">显示旧消</td></tr>
<tr><td class="left"></td><td class="left">/ a</td><td class="left">查询给定作者消息</td></tr>
<tr><td class="left"></td><td class="left">C-u / a</td><td class="left">反向查询</td></tr>
<tr><td class="left"></td><td class="left">/ /</td><td class="left">根据主题查询</td></tr>
<tr><td class="left"></td><td class="left">/ x</td><td class="left">根据邮件头查询</td></tr>
<tr><td class="left"></td><td class="left">/ t</td><td class="left">根据时间查询</td></tr>
<tr><td class="left"></td><td class="left">/ w</td><td class="left">remove previous query limit</td></tr>
<tr><td class="left"></td><td class="left">C-u / w</td><td class="left">remove all query limit</td></tr>
<tr><td class="left"></td><td class="left">M-s</td><td class="left">查询Article Buffer的内容</td></tr>
<tr><td class="left"></td><td class="left">M-r</td><td class="left">向前查询Article Buffer内容</td></tr>
<tr><td class="left">Article</td><td class="left">C-c C-c</td><td class="left">发送</td></tr>
<tr><td class="left"></td><td class="left">C-c C-d</td><td class="left">保存为草稿</td></tr>
<tr><td class="left"></td><td class="left">C-c C-k</td><td class="left">删除</td></tr>
<tr><td class="left"></td><td class="left">C-c C-m f</td><td class="left">粘贴附件</td></tr>
<tr><td class="left"></td><td class="left">M-q</td><td class="left">重排段落</td></tr>
</tbody>
</table>



<p>
其他有关配置信息参见sachachua的文章<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>
</p></div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Key Bindings</h2>
<div class="outline-text-2" id="text-10">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key</th><th scope="col" class="left">Function</th><th scope="col" class="left">Comment</th></tr>
</thead>
<tbody>
<tr><td class="left">M-&lt;TAB&gt;</td><td class="left">complete-at-point</td><td class="left"></td></tr>
<tr><td class="left">C-M-i</td><td class="left">complete-at-point</td><td class="left"></td></tr>
<tr><td class="left">C-u C-h i</td><td class="left"></td><td class="left">read the given info file</td></tr>
<tr><td class="left">C-c C-h</td><td class="left"></td><td class="left">show keys with the prefix "C-c"</td></tr>
<tr><td class="left">M-/</td><td class="left">hippie-expand</td><td class="left"></td></tr>
<tr><td class="left">C-M-/</td><td class="left">dabbrev-completion</td><td class="left">find and present suggestions for completion</td></tr>
<tr><td class="left">M-r</td><td class="left">move-to-window-line-top-bottom</td><td class="left">positions point at center of window</td></tr>
<tr><td class="left">C-`</td><td class="left">push-mark-no-activate</td><td class="left">push point to mark-ring without activate it</td></tr>
<tr><td class="left">M-`</td><td class="left">jump-to-mark</td><td class="left">jump to the local mark</td></tr>
<tr><td class="left">C-x TAB</td><td class="left">ido-imenu</td><td class="left"></td></tr>
<tr><td class="left">C-x C-n</td><td class="left"></td><td class="left">goal column</td></tr>
<tr><td class="left">C-M-a</td><td class="left"></td><td class="left">beginning of defun</td></tr>
<tr><td class="left">C-M-e</td><td class="left"></td><td class="left">end of defun</td></tr>
<tr><td class="left">M-g M-n</td><td class="left"></td><td class="left">next error</td></tr>
<tr><td class="left">M-g M-p</td><td class="left"></td><td class="left">previous error</td></tr>
<tr><td class="left">C-u M-g M-g</td><td class="left"></td><td class="left">execute goto-line in the previous buffer</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">Org Mode</h2>
<div class="outline-text-2" id="text-11">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">key</th><th scope="col" class="left">Command</th><th scope="col" class="left">Comment</th></tr>
</thead>
<tbody>
<tr><td class="left">C-M-i</td><td class="left">org-complete</td><td class="left">C-i equal to TAB</td></tr>
<tr><td class="left">ESC-TAB</td><td class="left">org-complete</td><td class="left">ESC equal to M</td></tr>
</tbody>
</table>




</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1">Orgtbl mode</h3>
<div class="outline-text-3" id="text-11-1">


<p>  
Email from Michael Brand: Re: Row formula in orgtbl mode]]
Row formulas are not supported, but the new range formulas you already
tried are even more powerful:
</p>
<p>  
Your range formula @4$2..@4$5=@-1*@-2 will work if you upgrade at
least to this commitdiff
<a href="http://orgmode.org/w/?p=org-mode.git;a=commitdiff;h=8237c9ae6d587a22646333e0315683675e2db538">http://orgmode.org/w/?p=org-mode.git;a=commitdiff;h=8237c9ae6d587a22646333e0315683675e2db538</a>
and will deliver
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<tbody>
<tr><td class="left"></td><td class="right">a</td><td class="right">b</td><td class="right">c</td><td class="right">d</td></tr>
<tr><td class="left">Specific cost</td><td class="right">1</td><td class="right">9</td><td class="right">2</td><td class="right">3</td></tr>
<tr><td class="left">System size</td><td class="right">1000</td><td class="right">1000</td><td class="right">1000</td><td class="right">1000</td></tr>
<tr><td class="left"></td><td class="right">1000</td><td class="right">9000</td><td class="right">2000</td><td class="right">3000</td></tr>
<tr><td class="left">&hellip;</td><td class="right">&hellip;</td><td class="right">&hellip;</td><td class="right">&hellip;</td><td class="right">&hellip;</td></tr>
</tbody>
</table>


<p>
For this application I would suggest
</p>
</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2">clock history</h3>
<div class="outline-text-3" id="text-11-2">


<p>
跳转到clock历史记录的方法为 <code>C-u C-c C-x C-j</code>, 如果在agenda mode中，还
可以通过 <code>J</code> 来进行跳转。
</p>
</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3">如何利用norang中关于orgmode的设置 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="NOTE">NOTE</span></span></h3>
<div class="outline-text-3" id="text-11-3">

<p>  <a href="file:///Users/eric/workspace/org-mode-doc/org-mode.html">~/workspace/org-mode-doc/org-mode</a>
</p>
<p>
  <code>norang</code> 中的 <code>orgmode</code> 设置非常详细，每次参考其 <code>orgmode</code> 的相关设置
  需要作大的改变。因为在其关于 <code>orgmode</code> 设置的文档中，所有的设置均可以
  通过 <code>tangle(org-babel-tangle)</code> 导出为配置文件，在自己的=orgmode= 的
  配置文件中通过引用 <code>norang</code> 的配置文件实现对其配置信息的引用。
</p></div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Tags</h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">在Emacs中正确使用Ruby的tags的方法</h3>
<div class="outline-text-3" id="text-12-1">

<ul>
<li>使用bundle install &ndash;path vendor将gems安装到本地项目目录下
</li>
<li>执行如下命令来生产ruby文件的tag
</li>
</ul>





<pre class="src src-sh">ctags -e -f TAGS --tag-relative -R app lib vendor
</pre>


<p>
这样就可以在Emacs中使用tags了。如果项目有变化，可以通过执行 =watchr=的
有关脚本来同步更新TAGS文件。
</p>

</div>

<div id="outline-container-12-1-1" class="outline-4">
<h4 id="sec-12-1-1"><span class="todo NEXT">NEXT</span> 编写watchr脚本用于动态更新TAGS文件</h4>
<div class="outline-text-4" id="text-12-1-1">

</div>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">Screen中使用emacsclient的方法 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="NOTE">NOTE</span></span></h2>
<div class="outline-text-2" id="text-13">

<p><a href="file:///Users/eric/.emacs.d/ericluo.el#server-start">~/.emacs.d/ericluo.el::(server-start)</a>
</p>
<p>
Emacs23以后的版本可以支持multi-term，在bash中可以通过emacsclient -t来
直接在terminal中运行emacsclient。
</p>



<pre class="src src-sh"><span style="color: #8cd0d3;">export</span> <span style="color: #f0dfaf;">EDITOR</span>=<span style="color: #cc9393;">"emacsclient -t"</span>
</pre>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> <a href="http://sachachua.com/notebook/wickedcool/wc-emacs-06-gnus.html">http://sachachua.com/notebook/wickedcool/wc-emacs-06-gnus.html</a>
</p></div>
</div>

</div>
</div>
